[
  {
    "title": "About MSIT",
    "content": "Maharaja Surajmal Institute of Technology (MSIT) is a reputed engineering college affiliated to Guru Gobind Singh Indraprastha University (GGSIPU), New Delhi. It is known for academic excellence, dedicated faculty, and a student-friendly environment. The institute focuses on holistic development through quality education, research, and extracurricular activities."
  },
  {
    "title": "Courses Offered",
    "content": "MSIT offers B.Tech programs in Computer Science and Engineering (CSE), Information Technology (IT), Electronics and Communication Engineering (ECE), and Electrical and Electronics Engineering (EEE). Each course is designed to provide industry-relevant skills and practical exposure through labs, projects, and internships."
  },
  {
    "title": "Admission Process",
    "content": "Admissions to B.Tech courses at MSIT are based on JEE Main scores, followed by GGSIPU counseling. Candidates must register on the GGSIPU admission portal and fill in their preferences. Seats are allotted on the basis of merit, category, and choice filling."
  },
  {
    "title": "Fee Structure",
    "content": "The annual fee for B.Tech programs at MSIT is approximately ₹1.35 lakhs. This includes tuition fees, university charges, and other miscellaneous fees. Fees may vary slightly based on the course and academic year."
  },
  {
    "title": "Infrastructure",
    "content": "MSIT boasts a modern campus with well-equipped laboratories, high-speed internet, smart classrooms, and a rich library. There are separate blocks for each department, a central auditorium, and multiple seminar halls. The lush green campus also provides peaceful study zones."
  },
  {
    "title": "Faculty",
    "content": "The faculty at MSIT is highly qualified, with most professors holding PhDs and vast teaching experience. They are supportive and approachable, encouraging students to engage in research and innovation."
  },
  {
    "title": "Placements",
    "content": "MSIT has a dedicated Training and Placement Cell that works closely with top recruiters like Amazon, Infosys, TCS, Wipro, and Cognizant. The average package lies between ₹5-6 LPA, with the highest going up to ₹30+ LPA for CSE/IT branches."
  },
  {
    "title": "Internships",
    "content": "Students are encouraged to undertake internships during semester breaks. Many students get internships via college tie-ups or off-campus initiatives, helping them gain practical industry experience before graduation."
  },
  {
    "title": "Clubs and Societies",
    "content": "MSIT hosts various cultural, technical, and departmental societies including dance, drama, coding, robotics, and photography clubs. Annual events like 'AVENSIS' (tech fest) and 'TRYST' (cultural fest) are student favorites."
  },
  {
    "title": "Hostel Facilities",
    "content": "MSIT offers hostel facilities for boys and girls. Hostels are equipped with mess services, Wi-Fi, 24x7 security, and recreational areas. Rooms are allotted based on availability and application order."
  },
  {
    "title": "Library",
    "content": "The library houses a large collection of textbooks, reference books, journals, and e-resources. It is open for extended hours during exams, providing students with a quiet and resource-rich study environment."
  },
  {
    "title": "Placements",
    "content": "MSIT placement cell helps students with job opportunities, internships, and interview prep. Companies like Amazon, Infosys, and TCS recruit from MSIT. High placement rate and strong alumni network in IT and core companies."
  },
  {
    "title": "Anti-Ragging Policy",
    "content": "MSIT follows a strict anti-ragging policy with a zero-tolerance approach. It complies with UGC and AICTE regulations and has dedicated committees, awareness programs, and anonymous reporting systems to ensure a safe campus environment."
  },
  {
    "title": "Location",
    "content": "MSIT is located in Janakpuri, New Delhi, well-connected via metro and buses. The area around the campus is safe and developed, with access to food joints, stationery shops, and medical stores."
  },
  {
    "title": "Alumni Network",
    "content": "MSIT has a strong alumni base working in top MNCs, startups, and government organizations. Alumni often return to share insights, conduct workshops, or offer mentorship, which benefits the current students."
  },
  {
    "title": "Anti-Ragging Policy",
    "content": "MSIT strictly follows UGC’s anti-ragging guidelines. The campus has an active anti-ragging committee to ensure a safe, friendly, and inclusive atmosphere for all newcomers."
  },
  {
    "title": "Code of Conduct",
    "content": "The institute promotes discipline, punctuality, and ethical behavior. Students are expected to attend classes regularly, maintain decorum, and uphold the reputation of MSIT both on and off campus."
  }
]
